In [1]:
import pandas as pd

In [2]:
from pd import Series, DataFrame

ModuleNotFoundError: No module named 'pd'

In [4]:
obj = pd.Series([4, 7, -5, 3])obj

SyntaxError: invalid syntax (<ipython-input-4-a15367877509>, line 1)

In [5]:
obj = pd.Series([4, 7, -5, 3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a']

-5

In [14]:
obj2['d']

4

In [15]:
obj2['d'] = 6

In [16]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [17]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [18]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [19]:
np.exp(obj2)

NameError: name 'np' is not defined

In [20]:
import numpy as np

In [21]:
obj2.exp

AttributeError: 'Series' object has no attribute 'exp'

In [22]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
'b' in obj2

True

In [24]:
'e' in obj2

False

In [25]:
7 in obj2

False

In [26]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon':16000, 'Utah':5000}

In [27]:
obj3 = pd.Series(sdata)

In [28]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [29]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [30]:
obj4 = pd.Series(sdata, index = states)

In [31]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
4pd.isnull(obj)

SyntaxError: invalid syntax (<ipython-input-32-1901611de758>, line 1)

In [33]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [34]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [35]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [36]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
obj4.name = 'population'

In [40]:
obj4.index.name = "state"

In [41]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [42]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [43]:
obj.index = ['Bob','Steve', 'Jeff', 'Ryab']

In [44]:
obj

Bob      4
Steve    7
Jeff    -5
Ryab     3
dtype: int64

In [45]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']}

In [46]:
data += {'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

TypeError: unsupported operand type(s) for +=: 'dict' and 'dict'

In [47]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}}

SyntaxError: invalid syntax (<ipython-input-47-595f0a687faa>, line 3)

In [48]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]

SyntaxError: unexpected EOF while parsing (<ipython-input-48-d3e6e895b157>, line 3)

In [49]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [50]:
frame = pd.DataFrame(data)

In [51]:
frame

    state   year  pop
0    Ohio   2000  1.5
1    Ohio   2001  1.7
2    Ohio  20002  3.6
3  Nevada   2001  2.4
4  Nevada   2002  2.9
5  Nevada   2003  3.2

In [52]:
pd.DataFrame(data, colums=['year', 'state'.'pop')

SyntaxError: invalid syntax (<ipython-input-52-127e8b3d549b>, line 1)

In [53]:
pd.DataFrame(data, colums=['year', 'state'.'pop',

SyntaxError: invalid syntax (<ipython-input-53-92f6c7f95bca>, line 1)

In [1]:
pd.DataFrame(data, colums=['year', 'state', 'pop']

SyntaxError: unexpected EOF while parsing (<ipython-input-1-fe07584c7861>, line 1)

In [2]:
pd.DataFrame(data, colums=['year', 'state', 'pop'])

NameError: name 'pd' is not defined

In [3]:
import pandas as pd

In [4]:
pd.DataFrame(data, colums=['year', 'state', 'pop'])

NameError: name 'data' is not defined

In [5]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [6]:
frame = pd.DataFrame(data)

In [7]:
frame.head()

    state   year  pop
0    Ohio   2000  1.5
1    Ohio   2001  1.7
2    Ohio  20002  3.6
3  Nevada   2001  2.4
4  Nevada   2002  2.9

In [8]:
pd.DataFrame(data, colums=['year', 'state', 'pop'])

TypeError: __init__() got an unexpected keyword argument 'colums'

In [9]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

    year   state  pop
0   2000    Ohio  1.5
1   2001    Ohio  1.7
2  20002    Ohio  3.6
3   2001  Nevada  2.4
4   2002  Nevada  2.9
5   2003  Nevada  3.2

In [10]:
frame2 = pd.DataFrame(data, columns = ['year', 'staate', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [11]:
frame2

        year staate  pop debt
one     2000    NaN  1.5  NaN
two     2001    NaN  1.7  NaN
three  20002    NaN  3.6  NaN
four    2001    NaN  2.4  NaN
five    2002    NaN  2.9  NaN
six     2003    NaN  3.2  NaN

In [12]:
frame2.columns

Index(['year', 'staate', 'pop', 'debt'], dtype='object')

In [13]:
frame2['state']

KeyError: 'state'

In [14]:
frame2['staate']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: staate, dtype: object

In [15]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [16]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [17]:
frame2.debt

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [1]:
import pandas as pd

In [2]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

NameError: name 'data' is not defined

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [4]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [5]:
frame2['dedbt'] = 16.5

In [6]:
frame2

        year   state  pop debt  dedbt
one     2000    Ohio  1.5  NaN   16.5
two     2001    Ohio  1.7  NaN   16.5
three  20002    Ohio  3.6  NaN   16.5
four    2001  Nevada  2.4  NaN   16.5
five    2002  Nevada  2.9  NaN   16.5
six     2003  Nevada  3.2  NaN   16.5

In [7]:
frame2['debt'] = 16.5

In [8]:
frame2

        year   state  pop  debt  dedbt
one     2000    Ohio  1.5  16.5   16.5
two     2001    Ohio  1.7  16.5   16.5
three  20002    Ohio  3.6  16.5   16.5
four    2001  Nevada  2.4  16.5   16.5
five    2002  Nevada  2.9  16.5   16.5
six     2003  Nevada  3.2  16.5   16.5

In [9]:
frame2.del(['dedbt'])

SyntaxError: invalid syntax (<ipython-input-9-2da39ff51e24>, line 1)

In [10]:
frame2['debt'] = np.arange(5.)

NameError: name 'np' is not defined

In [11]:
frame2

        year   state  pop  debt  dedbt
one     2000    Ohio  1.5  16.5   16.5
two     2001    Ohio  1.7  16.5   16.5
three  20002    Ohio  3.6  16.5   16.5
four    2001  Nevada  2.4  16.5   16.5
five    2002  Nevada  2.9  16.5   16.5
six     2003  Nevada  3.2  16.5   16.5

In [12]:
import numpy as np

In [13]:
frame2['debt'] = np.arange(6.)

In [14]:
frame2

        year   state  pop  debt  dedbt
one     2000    Ohio  1.5   0.0   16.5
two     2001    Ohio  1.7   1.0   16.5
three  20002    Ohio  3.6   2.0   16.5
four    2001  Nevada  2.4   3.0   16.5
five    2002  Nevada  2.9   4.0   16.5
six     2003  Nevada  3.2   5.0   16.5

In [15]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])

In [16]:
frame2['debt'] = val

In [17]:
frame2

        year   state  pop  debt  dedbt
one     2000    Ohio  1.5   NaN   16.5
two     2001    Ohio  1.7  -1.2   16.5
three  20002    Ohio  3.6   NaN   16.5
four    2001  Nevada  2.4  -1.5   16.5
five    2002  Nevada  2.9  -1.7   16.5
six     2003  Nevada  3.2   NaN   16.5

In [18]:
frame2['eastern'] = frame2['state'] == 'Ohio'

In [19]:
frame2

        year   state  pop  debt  dedbt  eastern
one     2000    Ohio  1.5   NaN   16.5     True
two     2001    Ohio  1.7  -1.2   16.5     True
three  20002    Ohio  3.6   NaN   16.5     True
four    2001  Nevada  2.4  -1.5   16.5    False
five    2002  Nevada  2.9  -1.7   16.5    False
six     2003  Nevada  3.2   NaN   16.5    False

In [20]:
del frame2['eastern']

In [21]:
frame2

        year   state  pop  debt  dedbt
one     2000    Ohio  1.5   NaN   16.5
two     2001    Ohio  1.7  -1.2   16.5
three  20002    Ohio  3.6   NaN   16.5
four    2001  Nevada  2.4  -1.5   16.5
five    2002  Nevada  2.9  -1.7   16.5
six     2003  Nevada  3.2   NaN   16.5

In [22]:
del frame2.dedbt

AttributeError: dedbt

In [23]:
del frame2['dedbt']

In [24]:
frame2

        year   state  pop  debt
one     2000    Ohio  1.5   NaN
two     2001    Ohio  1.7  -1.2
three  20002    Ohio  3.6   NaN
four    2001  Nevada  2.4  -1.5
five    2002  Nevada  2.9  -1.7
six     2003  Nevada  3.2   NaN

In [25]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [26]:
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      "Ohio":{2000: 1.5, 2001:1.7, 2002: 3.6}}

In [27]:
frame3 = pd.DataFrame(pop)

In [28]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [29]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [30]:
pd.DataFrame(pop, index = [2001, 2001, 2002])

      Nevada  Ohio
2001     2.4   1.7
2001     2.4   1.7
2002     2.9   3.6

In [31]:
data = {"Ohio": frame3['Ohio'][:-1],}

In [32]:
data = {"Ohio": frame3['Ohio'][:-1],
       'Nevada':frame3['Nevada'][:2]}

In [33]:
pd.DataFrame(pdata)

NameError: name 'pdata' is not defined

In [34]:
pd.DataFrame(pdata)

NameError: name 'pdata' is not defined

In [35]:
data = {"Ohio": frame3['Ohio'][:-1],}

In [36]:
pdata = {"Ohio": frame3['Ohio'][:-1],
       'Nevada':frame3['Nevada'][:2]}

In [37]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [38]:
frame3.index.name = 'year'

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
pop = {'Nevada': {2001: 2.4, 2002:2.9},
      "Ohio":{2000: 1.5, 2001:1.7, 2002: 3.6}}

In [4]:
frame3 = pd.DataFrame(pop)

In [5]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [6]:
frame3 =.index.name = 'year';frame3.columns.name = 'state'

SyntaxError: invalid syntax (<ipython-input-6-b1ccc949bf61>, line 1)

In [7]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [8]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [9]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [10]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 20002, 2001, 2002, 2003], 
         'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [11]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [20002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [12]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

In [13]:
index obj.index

SyntaxError: invalid syntax (<ipython-input-13-14e7529fb2a5>, line 1)

In [14]:
index = obj.index

In [15]:
index

Index(['a', 'b', 'c'], dtype='object')

In [16]:
index{1:}

SyntaxError: invalid syntax (<ipython-input-16-93ca007864b8>, line 1)

In [17]:
index{1:]

SyntaxError: invalid syntax (<ipython-input-17-c2656e96920f>, line 1)

In [18]:
index[1:}

SyntaxError: invalid syntax (<ipython-input-18-d9494bb14d6f>, line 1)

In [19]:
index[1:]

Index(['b', 'c'], dtype='object')

In [20]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [21]:
labels = pd.Index(np.arange(3))

In [22]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [23]:
obj2 =pd.Series([1.5, -2.5, 0], index =labels)

In [24]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [25]:
obj2.index is labels

True

In [26]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [27]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [28]:
'Ohio'in frame3,columns

NameError: name 'columns' is not defined

In [29]:
'Ohio'in frame3.columns

True

In [30]:
2003 in frame3.index

False

In [31]:
dup_labels = pd.Index(['foo', 'fopo', 'bar','bar'])

In [32]:
dup_labels

Index(['foo', 'fopo', 'bar', 'bar'], dtype='object')

In [33]:
obj =pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [34]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [35]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [36]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [37]:
obj3 = pd.Series(['blue', 'purple', 'yellow' ])

In [38]:
obj3

0      blue
1    purple
2    yellow
dtype: object

In [39]:
obj3 = pd.Series(index = ['0', '2', '4'])

In [40]:
obj3

0   NaN
2   NaN
4   NaN
dtype: float64

In [41]:
obj3 = pd.Series(['blue', 'purple', 'yellow' ], index = ['0', '2', '4'])

In [42]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [43]:
obj3.reindex(range(6), method = 'ffill')   obj3.reindex(range(6), method = 'ffill')

TypeError: '<' not supported between instances of 'int' and 'str'

In [1]:
import pandas as pd

In [2]:
obj3 = pd.Series(['blue', 'purple', 'yellow'])

In [3]:
obj3

0      blue
1    purple
2    yellow
dtype: object

In [4]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1    purple
2    yellow
3    yellow
4    yellow
5    yellow
dtype: object

In [5]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                    index = ['a', 'c', 'b'],
                    columns = ['Ohio', 'Texas', 'California'])

NameError: name 'np' is not defined

In [6]:
import numpy as np

In [7]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                    index = ['a', 'c', 'b'],
                    columns = ['Ohio', 'Texas', 'California'])

In [8]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
b     6      7           8

In [11]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [12]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   6.0    7.0         8.0
c   3.0    4.0         5.0
d   NaN    NaN         NaN

In [13]:
states = ['Texas', 'Utah', 'California']

In [14]:
feame.reindex(columns = states)

NameError: name 'feame' is not defined

In [15]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
b      7   NaN           8

In [16]:
obj = pd.Series(np.arange(5), index = ['a', 'b', 'c', 'd', 'e'])

In [17]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [18]:
new_obj = obj.drop('c')

In [19]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [20]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: int32

In [21]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                   index =['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'thres','four'])

In [22]:
data

          one  two  thres  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data.drop(['Colorado', 'Ohio'])

          one  two  thres  four
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data.drop('two', axis = 1)

          one  thres  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [25]:
data.drop(['two', 'four'], axis = 'columns')

          one  thres
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [26]:
obj.drop('c', inplace = True)

In [27]:
obj

a    0
b    1
d    3
e    4
dtype: int32

In [28]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])

In [29]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [30]:
obj['b']

1.0

In [31]:
obj[1]

1.0

In [32]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [33]:
obj['b', 'a', 'd']

KeyError: ('b', 'a', 'd')

In [34]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [35]:
obk[1, 3]

NameError: name 'obk' is not defined

In [36]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [37]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [38]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [39]:
obj['b':'c'] = 5

In [40]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [41]:
data =pd.DataFrame(np.arange(16).reshape(4, 4)
                  index =['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'thres','four'])

SyntaxError: invalid syntax (<ipython-input-41-35caffa7d392>, line 2)

In [42]:
data =pd.DataFrame(np.arange(16).reshape(4, 4),
                  index =['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'thres','four'])

In [43]:
data

          one  two  thres  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [45]:
data[['three', 'one']]

KeyError: "['three'] not in index"

In [46]:
data[['thres', 'one']]

          thres  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [47]:
data[:2]

          one  two  thres  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [48]:
data[data['thres'] > 5]

          one  two  thres  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data < 5

            one    two  thres   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [50]:
data[data < 5] = 0

In [51]:
data

          one  two  thres  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [52]:
data.loc['Colorado', ['two', 'three']]

D:\Anaconda3\lib\site-packages\pandas\core\indexing.py:1017: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return getattr(section, self.name)[new_key]

two      5.0
three    NaN
Name: Colorado, dtype: float64

In [53]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [54]:
data.iloc[2]

one       8
two       9
thres    10
four     11
Name: Utah, dtype: int32

In [55]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [56]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [57]:
data.iloc[:, :3][data.three > 5]

AttributeError: 'DataFrame' object has no attribute 'three'

In [58]:
data.iloc[:, :3][data.thres > 5]

          one  two  thres
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14